{ "data":[
    {
        "symbol":"ADVANC",
        "name":"Advanced Info Service Public Company Limited",
        "description": "Advanced Info Service Public Company Limited, together its subsidiaries, provides mobile network, fixed broadband, and digital services primarily in Thailand. The company operates through three segments: Mobile Phone Services, Mobile Phone and Equipment Sales, and Datanet and Broadband Services. It is involved in the operation of cellular telephone networks in the frequency of 700 MHz, 900 MHz, 1800 MHz, 2100 MHz, and 2600 MHz frequencies. The company also imports and distributes handsets and accessories, as well as distributes cash cards; and provides online data communications services through telephone landlines and optical fiber, as well as electronic payment services. In addition, it provides international telephone service, broadcasting network, and television broadcasting services for various channels, as well as insurance brokerage services. Further, the company offers IT system, content aggregator, and billing and collection outsourcing services; call center services; and land and building rental services, as well as related facilities. Additionally, it provides internet data center, and internet and satellite uplink-downlink services for communications; and distributes internet equipment; publishes business telephone directories and advertising; offers mobile contents; and provides online advertising services. The company was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "sector": "Communication Services"

    },
    {
        "symbol":"AOT",
        "name":"Airports of Thailand Public Company Limited",
        "description": "Airports of Thailand Public Company Limited engages in developing, managing, and operating international airports in Thailand. The company operates through Airport Management Business, Hotel Business, Ground Aviation Services, and Security Business segments. It operates 6 international airports, including Suvarnabhumi, Don Mueang, Chiang Mai, Hat Yai, Phuket, and Mae Fah Luang Chiang Rai airports. The company is also involved in the hotel and restaurant business; and services or rental of ground equipment, as well as provides security services. Airports of Thailand Public Company Limited was founded in 1903 and is based in Bangkok, Thailand.",
        "sector": "Industrials"
    },
    {
        "symbol":"BBL",
        "name":"Bangkok Bank Public Company Limited",
        "description": "Bangkok Bank Public Company Limited provides various commercial banking products and services primarily in Thailand. The company operates through Domestic Banking, International Banking, Investment Banking, and Others segments. It offers various personal banking products and services, including savings, current, fixed deposit, foreign currency, and other accounts; home, personal, and other loans; mutual funds; investments products and services, such as bonds and debentures, as well as securities brokerage services; life and non-life bancassurance products; payment, funds transfer, currency exchange, and SMS services; debit, credit, purchasing, and prepaid cards; and phone and Internet banking, mobile banking, ATMs, and other services. The company also provides business banking products and services comprising operating accounts; loans for SMEs, international trade, investment banking, and e-guarantee services; securities services, such as custodian, mutual fund supervisor, provident fund registrar, securities registrar, and debenture holders' representative services; business loans, payroll, and online banking services; corporate financing services; and merchant and commercial cards. In addition, it offers trade finance, remittances, export and import, project, corporate finance, and advisory services, as well as liquidity, cash, fund, and asset management services. As of December 31,2020, the company operated through a network of 1,128 branches in Thailand; and approximately 300 branches in Cambodia, China, Hong Kong, Indonesia, Japan, Laos, Malaysia, Myanmar, the Philippines, Singapore, Taiwan, the United Kingdom, the United States, and Vietnam. Bangkok Bank Public Company Limited was founded in 1944 and is headquartered in Bangkok, Thailand.",
        "sector": "Financial Services"
    },
    {
        "symbol":"BDMS",
        "name":"Bangkok Dusit Medical Services Public Company Limited",
        "description": "Bangkok Dusit Medical Services Public Company Limited, together with its subsidiaries, operates hospitals. The company owns and manages 6 hospital groups, including Bangkok Hospital Group, Samitivej Hospital Group, BNH Hospital, Phyathai Hospital Group, Paolo Hospital Group, and Royal Hospital Group. It operates regenerative and preventive wellness clinics. In addition, the company operates hotels and restaurant; sells health foods; provides accounting, health insurance, laboratory services, investment, information technology, training, insurance brokerage, air medical transportation, and property management services, as well as asset management services; and manufactures and distributes medicine and pharmaceutical products. Further, it is involved in the e-commerce business. As of December 31, 2020, the company operates 49 hospitals in Thailand and Cambodia. Bangkok Dusit Medical Services Public Company Limited was incorporated in 1969 and is based in Bangkok, Thailand.",
        "sector": "Health Care"
    },
    {
        "symbol":"BEM",
        "name":"Bangkok Expressway and Metro Public Company Limited",
        "description": "Bangkok Expressway and Metro Public Company Limited, together with its subsidiaries, engages in the construction and management of expressways and rail mass rapid transit system projects in Thailand. The company operates through Expressway Business, Rail Business, and Commercial Development Business segments. It is involved in the operation of metro services, including commercial development relating to the expressway and metro systems. The company also operates and manages the Si Rat Expressway, the Si Rat - Outer Ring Road Expressway, and the Udon Ratthaya Expressway, as well as the M.R.T. Chaloem Ratchamongkhon Line and MRT Chalong Ratchadham Line projects. In addition, it engages in the leasing of retail space, and provision of advertising services, as well as offers service and maintenance telecommunication systems equipment inside metro stations. The company was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "sector": "Industrials"
    },
    {
        "symbol":"BGRIM",
        "name":"B.Grimm Power Public Company Limited",
        "description": "B.Grimm Power Public Company Limited, an energy company, engages in the development, financing, construction, and operation of green-field power plants in Thailand, Laos, and Vietnam. It operates through two segments, Electricity Generating and Other Businesses. The Electricity Generation segment generates and distributes electricity for the government sectors and industrial users. The Other Businesses segment provides maintenance and operating services for power plants. The company generates electricity through co-generation, hydro, solar, wind, diesel, waste-to-energy, and natural gas. As of December 31, 2019, it had 46 power plants with a total capacity of 2,896 megawatts. The company was founded in 1878 and is headquartered in Bangkok, Thailand.",
        "sector": "Utilities"
    },
    {
        "symbol":"BH",
        "name":"Bumrungrad Hospital Public Company Limited",
        "description": "Bumrungrad Hospital Public Company Limited owns and operates healthcare-related entities in Thailand and internationally. The company offers diagnostic, therapeutic, and intensive care facilities in a medical center. Its outpatient clinics/centers include allergy, arrhythmia, behavioral health, breastfeeding, breast care, children, dental, diabetes, diagnostic, dialysis, digestive disease, emergency, eye, fertility and IVF, health screening, hearing and balance, heart valve, cancer, hyperbaric oxygen therapy, hypertension, joint replacement, liver, memory, men, nephrology, neuroscience, new life healthy aging, orthopedic, Parkinson's disease and movement disorders, perinatal, physical therapy and rehabilitation, plastic surgery, pulmonary, refractive surgery, robotic scoliosis and surgery, skin, sleep lab, spine, sports medicine and lifestyle, surgical, travel medicine, urology, vitalife, and women's, as well as ear, nose, and throat centers. In addition, the company is involved in the real estate assets holding activities; provision of clinical research services; distribution of pharmaceutical and medical goods in specialized stores; operation of personnel development and training center for healthcare services; and patient referral service business. It operates 580 beds and approximately 56 clinics/centers. The company was founded in 1980 and is headquartered in Bangkok, Thailand.",
        "sector": "Health Care"
    },
    {
        "symbol":"BJC",
        "name":"Berli Jucker Public Company Limited",
        "description": "Berli Jucker Public Company Limited manufactures, distributes, and services in the areas of packaging, consumer, healthcare and technical, modern retail supply chain, and other group businesses in Thailand. It designs, manufactures, markets, and distributes glass and plastic packaging products, and aluminum cans. The company is involved in the distribution of personal care products, including Cellox facial tissues and toilet papers, Zilk toilet papers, Maxmo multi-purpose papers, Tasto potato chips, Dozo rice crackers, Party and Campus extruded snacks, Parrot soaps, and Dermapon baby soaps, as well as provides logistics management services, such as warehouse, transportation, customs brokerage, and freight forwarding representative services. In addition, it offers food products comprises snacks, beverages, packaged fruits, and dairy and yogurt products; and non-food products, which includes personal care, household products, stationery and office equipment, and others. Further, the company imports and distributes medicines, medical supplies, cosmeceuticals, pharmaceuticals, food supplements, and health products; medicines for treatment of various diseases such as kidney, hematology, cardiovascular, endocrine system, genitourinary system, skeleton, infection, oncology and tumors, pediatric medicines, and beauty products. It also offers medical devices, such as computed radiography systems, ultrasound systems, digital mammography systems, X-ray systems, 3D medical image processing systems, and laboratory information systems. Additionally, the company engages in bakery, food and nutraceutical, and cosmetic ingredients; industrial chemicals and refrigerants; e-commerce business; consultancy, design, installation, and the after-sales services for cranes and solar rooftop system; and weighing control system. The company was founded in 1882 and is headquartered in Bangkok, Thailand. Berli Jucker Public Company Limited is a subsidiary of TCC Corporation Company Limited.",
        "sector": "Industrials"
    },
    {
        "symbol":"BTS",
        "name":"BTS Group Holdings Public Company Limited",
        "description": "BTS Group Holdings Public Company Limited, together with its subsidiaries, engages in mass transit, property, media, and service businesses in Thailand, Hong Kong, and Malaysia. The company's Mass Transit segment operates and maintains BTS Sky Train system and bus rapid transit line, as well as offers electric and mechanical installation services. Its Media segment manages and provides advertising spaces on the BTS stations and existing extensions, department stores, and office and commercial buildings, as well as in the street furniture media sector; offers design and installation services for multimedia display systems; and provides outdoor advertising media services. The company's Property segment develops and sells real estate properties. Its Services segment provides installation and construction services; and Rabbit Card services. It also invests in the securities of other companies; provides architecture and engineering work consultancy services; and manages food and beverage businesses. In addition, the company rents advertising spaces; purchases/sells electronic billboards; provides electronic payment, electronic money, and bill payment services; and produces and sells tri-vision equipment. Further, it provides Web portal and design services, as well as various e-commerce-related services, including online marketing services; engages in the provision of online insurance price comparison services; develops software and provides technology and system integration services; and offers CRM loyalty program and coupon kiosks. The company was formerly known as Tanayong Public Company Limited and changed its name to BTS Group Holdings Public Company Limited in May 2010. BTS Group Holdings Public Company Limited was founded in 1968 and is based in Bangkok, Thailand.",
        "sector": "industrials"
    },
    {
        "symbol":"CGP",
        "name":"Carabao Group Public Company Limited",
        "description": "Carabao Group Public Company Limited, through its subsidiaries, manufactures, markets, distributes, and sells beverages in Thailand and internationally. Its products primarily include carbonated and non-carbonated energy drinks, drinking water, ready-to-drink coffee, instant powder 3-in-1 coffee, vitamin C drinks, and zinc-contained drinks under the Carabao Dang, Carabao, Carabao Sport, and Woody C+ Lock brands. The company also manufactures, distributes, and procures glass bottles and aluminum cans, as well as carton boxes, oriented polypropylene labels, and shrink films used as packaging material for energy drinks and other beverages. In addition, it distributes third party products, including food and non-food category products; and manages distribution channels that includes multi-tiered agent system, distribution centers, cash vans, and modern trade channel, as well as engages in trading activities. The company was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "sector": "Consumer Defensive"
    },
    {
        "symbol":"COM7",
        "name":"Com7 Public Company Limited",
        "description": "Com7 Public Company Limited, together with its subsidiaries, sells IT products, mobiles, and accessories in Thailand. The company also develops computer software; provides repair and other services, as well as training services; and offers ICT infrastructure solutions. In addition, it engages in distribution activities. The company offers products through its retail outlets. Com7 Public Company Limited is based in Bangkok, Thailand.",
        "sector": "Comsumer Cyclical"
    },
    {
        "symbol":"CPALL",
        "name":"CP ALL Public Company Limited",
        "description": "CP ALL Public Company Limited, together with its subsidiaries, operates and franchises convenience stores under the 7-Eleven name to other retailers primarily in Thailand. It operates through three segments: Convenience Stores, Cash and Carry, and Other. The company is involved in the manufacture and sale of convenience and frozen foods, and bakery products; sale and maintenance of retail equipment; information technology, as well as marketing and advertising activities; provision of research and development services; and cash and carry and e-commerce business, as well as operates as a life and accident insurance broker. It also distributes commercial cards and tickets, catalog merchandises, and equipment for retailing and software development; and offers bill payment collection, information technology, logistics, smart purse cards, investment, educational institution, human resources development, and training and business seminar services, as well as healthcare and medical specialist's consultation services. As of December 31, 2019, CP ALL Public Company Limited operated 11,712 stores. The company was formerly known as C.P. Seven Eleven Public Company Limited and changed its name to CP ALL Public Company Limited in 2007. CP ALL Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "sector": "Consumer defensive"
    },
    {
        "symbol":"CPF",
        "name":"Charoen Pokphand Foods Public Company Limited",
        "description": "Charoen Pokphand Foods Public Company Limited, together with its subsidiaries, engages in the agro-industrial and integrated food businesses in Thailand and internationally. It operates in two segments, Livestock Business and Aquaculture Business. The company produces and sells swine, chicken, cattle, duck, shrimp, and fish feeds; and breeds and farms swine, broiler, layer, duck, shrimp, and fish. It is also involved in the animal feed raw materials distribution, investment and international trading, food products wholesale and retail, property investment, property lease-out, and shrimp hatchery and animal feedmill businesses. In addition, the company produces, sells, imports, and distributes elite seeds, eggs, milk products, processed meat and ready meals, and probiotics. Further, it offers economic and trade consulting, management and advisory, financial guarantee, biological waste management, information technology, food research and development, and financial services. Additionally, the company engages in the operation of food processing plants, restaurants, slaughterhouses, and training centers; broiler chicken integration business; provision and development of Asian food products; and swine farm construction activities. It provides its products primarily under the CP, CP Fresh Mart, Five Star Shop, and Star Coffee brand names, as well as other retail brands. The company also exports its products to approximately 40 countries worldwide. Charoen Pokphand Foods Public Company Limited was incorporated in 1978 and is headquartered in Bangkok, Thailand.",
        "sector": "Consumer Defensive"
    },
    {
        "symbol":"CPN",
        "name":"Central Pattana Public Company Limited",
        "description": "Central Pattana Public Company Limited develops and manages real estate properties primarily in Thailand. It develops and rents shopping centers, office buildings, condominiums, hotels, and residential buildings; offers property management consulting and corporate services; invests in real estates and leasehold property fund; and sells land and houses, and condominium units. The company also operates play land and water theme park, and hotels; manages real estate investment trust, condominium juristic person, and housing estate juristic person; and provides utility, food center, training, and personnel development services. As of December 31, 2020, its property portfolio comprised 34 shopping centers, 10 office buildings, 2 hotels, and 1 rental residential project. The company was founded in 1980 and is headquartered in Bangkok, Thailand.",
        "sector": "Real Estate"
    },
    {
        "symbol":"CRC",
        "name":"Central Retail Corporation Public Company Limited",
        "description": "Central Retail Corporation Public Company Limited operates as a multi-format multi-category retailing platform in Southeast Asia and Italy. It operates through Fashion, Hardline, and Food segments. The company sells fashion merchandise and other consumer products; consumer electronics, home decoration, construction materials, and DIY products; and grocery, organic and health foods, beverages, and consumer staples under a portfolio of retail banners. As of December 31, 2019, it operated 1,934 stores across 51 provinces in Thailand; 132 stores across 37 provinces in Vietnam; and 9 department stores in 8 cities in Italy. Central Retail Corporation Public Company Limited was founded in 1947 and is headquartered in Bangkok, Thailand.",
        "sector": "Consumer Cyclical"
    },
    {
        "symbol":"DELTA",
        "name":"Delta Electronics (Thailand) Public Company Limited",
        "description": "Delta Electronics (Thailand) Public Company Limited, together with its subsidiaries, researches and develops, manufactures, and distributes electronic products. It operates through Power Electronics, Infrastructure, and Automation segments. It offers inductors, RF inductors, transformers, networking products, EMI filters, solenoids, current sensing resistors, and power modules; switching power supplies, standard power modules, and lighting ballasts and LED drivers; DC brushless fans and blowers, motors, thermal management products, cabinet thermal solutions, and ventilation and automotive fans; EV/HEV powertrain solutions and power electronics components comprise of on-board chargers and DC/DC converters; and display and visualization, mobile power, industrial power, and medical power products, as well as healthcare devices. The company also provides industrial automation products and solutions, including drives and power quality products, motion control solutions, control systems, robots, software systems, and manufacturing equipment, as well as field devices that include temperature controllers, machine vision systems, pressure sensors, timers/counters/tachometers, industrial power supplies, power meters, and smart and vision sensors. In addition, it offers building automation products comprising building management and control system, LED lighting, intellegent surveillace, and building management system products; telecom power systems, networking systems, and UPS and datacenter infrastructure solutions; and EV charging and energy storage systems, renewable energy, industrial battery charging, and display and visualization products. Further, the company rents properties. It operates in the United States, China, Germany, india, Ireland, Singapore, Norway, Taiwan, the Netherlands, and internationally. The company was incorporated in 1988 and is based in Samut Prakan, Thailand.",
        "sector": "Industrials"
    },
    {
        "symbol":"DTAC",
        "name":"Total Access Communication Public Company Limited",
        "description": "Total Access Communication Public Company Limited, together with its subsidiaries, primarily provides wireless telecommunications services in Thailand. The company operates in two segments, Mobile Telephone Service and Related Services; and Sales of Handsets and Starter Kits. It primarily offers its services in 800 MHz and 1800 MHz frequency bands. The company also provides asset management services; and telecommunication equipment lease and device services. In addition, it sells mobile phones, SIM cards, voucher cards, and supplementary equipment; and operates information systems and centralized database for the number portability services. Total Access Communication Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "sector": "Communication Services"
    },
    {
        "symbol":"EA",
        "name":"Energy Absolute Public Company Limited",
        "description": "Energy Absolute Public Company Limited, together with its subsidiaries, produces and distributes biodiesel, purified glycerin, and byproducts in Thailand. The company also engages in the manufacture and distribution of crude palm oil and phase change materials, as well as electric buses, trucks, and other vehicles; and development, manufacture, and distribution of lithium-ion polymer batteries and high-capacity electricity storage systems. In addition, it generates electricity through solar, wind, and biogas power plants; provides logistics, renewable energy consulting, and waste disposal services; and operates electric charging and hub stations. The company was formerly known as Suntech Palm Oil Ltd. and changed its name to Energy Absolute Public Company Limited in 2008. Energy Absolute Public Company Limited was incorporated in 2006 and is headquartered in Bangkok, Thailand.",
        "sector": "Utilities"
    },
    {
        "symbol":"EGCO",
        "name":"Electricity Generating Public Company Limited",
        "description": "Electricity Generating Public Company Limited, together with its subsidiaries, generates and sells electricity to government sector and industrial users primarily in Thailand, the Philippines, and Australia. The company operates in two segments, Electricity Generation and Other Businesses. It generates electricity from various resources, such as natural gas, liquefied natural gas, coal, biomass, hydro, solar, wind, geothermal, and fuel cell. As of December 31, 2020, the company operated 28 operating power plants with total equity contracted capacity of 5,423 MW; and 2 projects under construction with total equity contracted capacity of 321 MW. It also provides operation, maintenance, engineering, and construction services to power plants, petrochemical plants, oil refineries, and other industries. Electricity Generating Public Company Limited was incorporated in 1992 and is headquartered in Bangkok, Thailand.",
        "sector": "Utilities"
    },
    {
        "symbol":"GLOBAL",
        "name":"Siam Global House Public Company Limited",
        "description": "Siam Global House Public Company Limited retails building materials and home decoration products in Thailand and Kingdom of Cambodia. It offers cements and construction materials; steels, nails, and wires; roofs and installation tools; and tanks, pipes, water systems, and gardening products. The company also provides decorative items, including doors, windows and woods, hardware, electrical accessories, sanitary wares and kitchens, ceramic tiles and decorative items, paints and chemicals, and furniture and appliances. As of December 31, 2020, it operated through a network of 71 branches. The company was founded in 1995 and is headquartered in Mueang Roi Et, Thailand.",
        "sector": "Consumer Cyclical"
    },
    {
        "symbol":"GPSC",
        "name":"Global Power Synergy Public Company Limited",
        "description": "Global Power Synergy Public Company Limited, together with its subsidiaries, engages in the production and distribution of electricity, steam, and water for industrial purpose in Thailand. The company operates through three segments: Independent Power Producer, Small Power Producer, and Others. It generates electricity through solar, hydropower, and thermal power plants. The company was founded in 2013 and is headquartered in Bangkok, Thailand.",
        "sector": "Utilities"
    },
    {
        "symbol":"GULF",
        "name":"Gulf Energy Development Public Company Limited",
        "description": "Gulf Energy Development Public Company Limited produces and sells electricity, steam, and chilled water to public and private clients in Thailand and internationally. It operates through three segments: Power Business, Consulting Business, and Infrastructure Business. The company generates electricity through gas-fired and renewable power projects under the independent power producers, small power producers, and very small power producers programs. It has a total gross installed power capacity of 11,910 MW. The company also undertakes infrastructure projects; and operates in natural gas related businesses, including procurement, and marketing and trading of natural gas. In addition, it engages in the trading activities; and the provision of managerial, technical, and supporting services. The company is headquartered in Bangkok, Thailand.",
        "sector": "Utilities"   
    },
    {
        "symbol":"HMPRO",
        "name":"Home Product Center Public Company Limited",
        "description": "Home Product Center Public Company Limited operates as a home improvement retailer in Thailand and Malaysia. The company trades in a range of goods and materials for construction, addition, refurbishment, renovation, and improvement of buildings, houses, and residences; and provides a range of related services. It also offers 3D, installation, maintenance, home makeover, warehousing, and distribution services. In addition, the company rents space. As of December 31, 2020, it had 115 branches. The company was founded in 1995 and is headquartered in Nonthaburi, Thailand.",
        "sector": "Consumer Cyclical"
    },
    {
        "symbol":"INTUCH",
        "name":"Intouch Holdings Public Company Limited",
        "description": "Intouch Holdings Public Company Limited, through its subsidiaries, engages in the satellite, Internet, telecommunications, and media and advertising businesses. It operates through Wireless Telecommunications Business, Satellite and International Businesses, and Other Businesses segments. The company offers transponder rental and related services for domestic and international communications; broadband content services; satellite uplink-downlink, broadcasting television and telecommunication services; Internet data center, Internet, and telecommunication services; advertising, insurance broker, and other related services; and sale and service related to media, telephone network, mobile content, and engineering development services on communication technology and electronics. It also sells user terminals of IPSTAR and direct television equipment; and distributes internet equipment. In addition, the company offers local mobile telecommunication services; provides computer program and related services, as well as information technology and home shopping services; and trades in and rents telecommunications equipment and accessories. It has operations in Thailand, Australia, India, Japan, Myanmar, Malaysia, and internationally. The company was formerly known as Shin Corporation Public Company Limited and changed its name to Intouch Holdings Public Company Limited in March 2014. Intouch Holdings Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "sector": "Communication Services"
    },
    {   
        "symbol":"IRPC",
        "name":"IRPC Public Company Limited",
        "description": "IRPC Public Company Limited, together with its subsidiaries, provides petroleum and petrochemical products in Thailand, Singapore, and internationally. The company operates through Petroleum Products, Petrochemical Products, and Other Business segments. It offers petroleum products, including liquefied petroleum gas, naphtha, gasoline, diesel, and fuel oil; lube base oil and asphalt; petrochemical products, such as olefins, such as ethylene, propylene, and butadiene; aromatics comprising benzene, toluene, and mixylene; polymers consisting of high-density polyethylene, polypropylene, acrylonitrile-butadiene-styrene, acrylonitrile styrene, polystyrene, and expandable polystyrene; and polyols. It also provides electricity, steam, and infrastructure, including wastewater treatment and other related services to industrial clients. In addition, the company offers port and tank services, such as tug boats, port pilots, service boats, mooring, freshwater, bunkers, nautical charts, cranes, hopper cars, weighing, cargo yards, and warehouses, as well as operates bulk and container, liquid and chemical, and oil-cargo terminals. Further, it is involved in the provision of asset management and oil vessel renting services; manufacture and distribution of plastic resins; operation of vocational schools; and distribution of petrochemical products, as well as power plant, jetty, and other utilities operations. The company was formerly known as Thai Petrochemical Industry Public Company Limited and changed its name to IRPC Public Company Limited in October 2006. IRPC Public Company Limited was incorporated in 1978 and is headquartered in Rayong, Thailand.",
        "sector": "Energy"
    },
    {
        "symbol":"IVL",
        "name":"Indorama Ventures Public Company Limited",
        "description": "Indorama Ventures Public Company Limited produces and distributes polyethylene terephthalate (PET), purified terephthalic acid (PTA), paraxylene, purified isophthalic acid, naphthalene dicarboxylate (NDC), integrated purified ethylene oxide and ethylene glycol, polyester, rayon, nylon, polypropylene, composites, and worsted wool fibers products. It operates in five segments: Integrated PET, Specialty Chemicals, Packaging, Integrated Oxides and Derivatives, and Fibers. The company offers various PET resins, including hot-fill, high and low intrinsic viscosity, quick heat, and general grade to serve beverage containers and food, pharmaceutical and household products, and industrial packaging applications, as well as produces clear and colored preforms, bottles, and closures. It also provides ethylene glycol used as a raw material in the production of polyester fibers, antifreeze, liquid coolant, and solvent; monoethylene glycol for use as a feedstock in the production of PET and polyester fibers; diethylene glycol used to manufacture polyester polyols, unsaturated polyester resins, buffet heaters, paints and coatings, plasticizers, liquid laundry detergents, and cement grinding; and triethylene glycol used for natural gas dehydration. In addition, the company offers surfactants, LAB, and ethanolamines used in manufacture of detergents, homecare products, soaps, toothpastes, shampoos, hair conditioners, and other foaming products. In addition, it provides polyester fibers and yarns used for apparels, home textile, automotive, and non-woven; bicomponent fibers; and worsted wool yarns used in making suits and sweaters, as well as tire cord yarns used in air bags and tire cords. The company operates in Thailand, North America, Europe, and internationally. The company was incorporated in 2003 and is headquartered in Bangkok, Thailand. Indorama Ventures Public Company Limited is a subsidiary of Indorama Resources Limited.",
        "sector": "Basic Materials"
    },
    {
        "symbol":"KBANK",
        "name":"Kasikornbank Public Company Limited",
        "description": "Kasikornbank Public Company Limited, together with its subsidiaries, provides commercial banking products and services. The company's personal banking products and services include savings, current, fixed deposit, and foreign currency accounts; personal, home, and auto loans; debit and credit cards; life and non-life insurance products; investment products, such as mutual funds, stocks, and derivatives/futures exchange; money transfer and bill payment, cheque and draft, and foreign exchange services; mobile banking services; and digital banking. It also offers various products and services for small and medium enterprises, including savings, current, and fixed deposits; working capital, commercial, special, and business loans, as well as letters of guarantee; collection and payment services; life, non-life, and group insurance products; cards; and international trade services. In addition, the company provides various products and services for corporate customers, such as cash management solutions, including current, savings, special savings deposit, and fixed deposit accounts, as well as collection, payment, liquidity management, and electronic solutions; international trade solutions comprising import and export, global money transfer, guarantee, and trade finance solutions; working capital loans, term loans, special loans, and letters of guarantee; supply chain financing; life, non-life, and group insurance products; and foreign exchange and derivatives, corporate finance, securities, investment, and business card services. It operates 860 branches in Thailand and 6 internationally. Kasikornbank Public Company Limited was founded in 1945 and is headquartered in Bangkok, Thailand.",
        "sector": "Finance Services"
    },
    {
        "symbol":"KCE",
        "name":"KCE Electronics Public Company Limited",
        "description": "KCE Electronics Public Company Limited, together with its subsidiaries, manufactures and distributes electric printed circuit boards (PCBs) under the KCE trademark worldwide. The company's PCBs manufactured from copper clad laminate are used in various applications, including automotive, industrial, computer, and telecom systems. It also manufactures and distributes chemicals products, and prepreg and laminate products. The company was formerly known as Kuang Charoen Electronics Company Limited. KCE Electronics Public Company Limited was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "sector": "Technology"
    },
    {   
        "symbol":"KTB",
        "name":"Krung Thai Bank Public Company Limited",
        "description": "Krung Thai Bank Public Company Limited provides various commercial banking products and services. The company operates through three segments: Retail Banking, Wholesale Banking, and Treasury and Investment. It provides various retail banking products and services, including current, savings, and fixed deposit accounts; time and foreign currency deposits; personal and housing loans; debit, travel, cash and top up, and credit cards; investment services; travel, motor, and home asset insurance products; money transfer, payment and top up, foreign exchange, and overseas education services; and e-banking services. The company also offers SME loans for small and medium businesses; and international business loans. In addition, it provides corporate banking products and services comprising cash management services, such as collection, liquidity management, and transfer and payment services; fixed deposit and current accounts; foreign currency and term deposits; cards; Fx, interest rate, equity, commodity, and credit derivatives; financial advisory services related to merger and acquisition transactions; financial advisory, underwriting, and selling agent services for products offered through the equity capital markets; project finance advisory and feasibility study services, as well as e-banking services; and investment solutions, such as government and corporate bonds, structured notes, and investment units. The company provides its services through a network of branches in Thailand and various centers internationally. Krung Thai Bank Public Company Limited was founded in 1966 and is headquartered in Bangkok, Thailand.",
        "sector": "Finance Services"
    },
    {
        "symbol":"KTC",
        "name":"Krungthai Card Public Company Limited",
        "description": "Krungthai Card Public Company Limited engages in the credit card, personal loan, and other related businesses in Thailand. It operates as a payment service provider. The company was incorporated in 1996 and is based in Bangkok, Thailand.",
        "sector": "Finance Services"
    },
    {
        "symbol":"LH",
        "name":"Land and Houses Public Company Limited",
        "description": "Land and Houses Public Company Limited engages in the property development activities in Thailand and the United States. It operates in two segments, Real Estate Business, and Rental and Service Business. The company's Real Estate Business segment develops and sells single detached houses, townhouses, and residence condominium projects. Its Rental and Service Business segment is involved in the rental of shopping malls, hotels, and apartments. The company also offers project administration and management, and investment advisory services. Land and Houses Public Company Limited was founded in 1973 and is headquartered in Bangkok, Thailand.",
        "sector": "Real Estate"
    },
    {
        "symbol":"MINT",
        "name":"Minor International Public Company Limited",
        "description": "Minor International Public Company Limited, together with its subsidiaries, operates as a hospitality, restaurant, and lifestyle company in Thailand, China, Australia, and internationally. It operates in four segments: Hotel & Spa, Mixed use, Restaurant, and Retail. As of February 25, 2020, the company had approximately 2,300 restaurant outlets in 26 countries under The Pizza Company, The Coffee Club, Riverside, Benihana, Thai Express, Bonchon, Swensen's, Sizzler, Dairy Queen, and Burger King brands. It also invested in, owned, and operated a portfolio of 530 hotels and serviced suites under the Anantara, Avani, Oaks, Tivoli, NH Collection, NH Hotels, nhow, Elewana Collection, Four Seasons, St. Regis, JW Marriott, Radisson Blu, and Minor International brands in 55 countries across the Asia Pacific, the Middle East, Africa, the Indian Ocean, Europe, and the Americas. In addition, the company distributes fashion and lifestyle products under the Anello, Bodum, Bossini, Charles & Keith, Esprit, Joseph Joseph, OVS, Radley, Zwilling J.A. Henckels, Scomadi, and Minor Smart Kids brands through approximately 450 points of sale; and provides online shopping and contract manufacturing services. Further, it is involved in the shopping mall, food and beverage sale, spa, supply chain management, distribution, management, vacation club point sale, entertainment, franchise, marketing, consulting, tour operation, asset management, airport lounge, and healthcare businesses; property investment, development, and sales activities; and manufacture and sale of cheese and ice-cream. The company was formerly known as Royal Garden Resorts Plc. and changed its name to Minor International Public Company Limited in 2005. Minor International Public Company Limited was founded in 1978 and is headquartered in Bangkok, Thailand.",
        "sector":"Consumer Cyclical"
    },
    {
        "symbol":"MTC",
        "name":"Muangthai Capital Public Company Limited",
        "description": "Muangthai Capital Public Company Limited provides various lending services in Thailand. The company offers loans that are secured against vehicle registrations, land title deeds loans, and Nano finance, as well as personal loans without collateral. It also provides car, motorcycles, and agricultural truck loans. In addition, the company offers hire purchase and insurance brokerage services. As of December 31, 2020, it had 4,884 branches and service centers. The company was formerly known as Muangthai Leasing Public Company Limited and changed its name to Muangthai Capital Public Company Limited in April 2018. Muangthai Capital Public Company Limited was founded in 1992 and is headquartered in Bangkok, Thailand.",
        "sector": "Finance Services"
    },
    {
        "symbol":"OR",
        "name":"PTT Oil and Retail Business Public Company Limited",
        "description": "PTT Oil and Retail Business Public Company Limited, together with its subsidiaries, engages in the retail and commercial marketing of petroleum products and other services in Thailand and internationally. It operates through Oil Business; Retail and Other Service Business; and International Business segments. The company offers lube oil blending, bottling, marketing, and retail services, as well as other fuel-related services; and aircraft refueling services; oil and retail business management services; human resources management services; and personnel services. In addition, it invests in companies, which engages in the management of retail fuel service stations, convenience stores, and space management in retail fuel service stations. Further, the company operates Cafe Amazon stores, convenience stores, and food and beverage retail stores; operates oil transmission pipelines; and trades in coffee brewing machines and coffee beans. As of December 31, 2020, it operated 2,334 service stations under the PTT Station brand; 3,575 Café Amazon outlets; and 78 Texas Chicken outlets. The company was incorporated in 2007 and is headquartered in Chatuchak, Thailand. PTT Oil and Retail Business Public Company Limited is a subsidiary of PTT Public Company Limited.",
        "sector": "Energy"
    },
    {
        "symbol":"OPS",
        "name":"Osotspa Public Company Limited",
        "description": "Osotspa Public Company Limited, together with its subsidiaries manufactures and distributes energy drinks and personal care products worldwide. The company operates in three segments: Beverage, Personal Care, and Others. It offers energy drinks under the M-150, Lipovitan-D, Chalarm, Som in-Sum, White Shark, Shark Energy Drink, and M-Storm brand names; ready-to drink coffee under the M-Presso name; sport drinks under the M-Electrolyte and V+ brands; and functional drinks under the Peptein, Peptein Gold, Calpis, VPlus, C-Vitt, Calpis Lacto, and Slimma brands. The company also provides baby care products under the Babi Mild brand name; male grooming products under the Exit brand; women beauty care products under the Twelve Plus, Plantstory, and Ole Strwaberry brands; healthcare products under the KRISNAKLAN, Utaitip, Tamjai, YATHAD 4, Yixin, and BANNER brands; and confectionery products under the Botan and Ole brand names. In addition, it provides marketing and property rental services; manufactures and distributes glass, and beverage concentrates and premixes; and distributes food, beverages, and cullet products. Further, the company engages in the import, retail, and wholesale of beverages; investing in other companies; provision of research and development services; electronic commerce business; and education and sale of herbal products. Additionally, it obtains licensing fee for use of trademark, as well as provides manufacturing and distribution services. Osotspa Public Company Limited was founded in 1891 and is headquartered in Bangkok, Thailand.",
        "sector": "Consumer Defensive"
    },
    {
        "symbol":"PTT",
        "name":"PTT Public Company Limited",
        "description": "PTT Public Company Limited, together with its subsidiaries, operates as a petroleum and petrochemical company in Thailand, other Asian countries, Europe, the United States, and internationally. The company operates through Upstream Petroleum and Natural Gas Business Group, Downstream Petroleum Business Group, and Technology and Engineering Group segments. It is involved in the exploration and production of petroleum; and natural gas procurement, pipeline transmission, distribution, and separation activities. In addition, the company engages in the exploration, production, and distribution of coal; and marketing of petroleum products and lube oil through an operating system of procurement, storage, and distribution of products, as well as the retail business at service stations. Further, it imports and exports petroleum and petrochemical products, as well as other related products; and produces and distributes electricity, steam, and water for industrial purpose, as well as offers project management services. Additionally, the company provides human resource support, petroleum related technology, consultant management, technical consultant for electricity businesses, petrol station and convenience store management, factory maintenance and engineering, oil and gas, safety and environmental, and business services, as well as services for the storage and handling of liquid chemicals. It also invests in liquefied natural gas business; produces and distributes chilled water/constructs and installs electricity generating systems; develops electricity power production projects; invests in other companies; develops, markets, and distributes polymers products, by products, and other polymers-related products; and manufactures and distributes biochemical products, as well as engages in the transportation, warehouse, and bagging packing management of polyethylene. PTT Public Company Limited was founded in 1978 and is headquartered in Bangkok, Thailand.",
        "sector": "Energy"
    },
    {   
        "symbol":"PTTEP",
        "name":"PTT Exploration and Production Public Company Limited",
        "description": "PTT Exploration and Production Public Company Limited, together with its subsidiaries, engages in the exploration and production of petroleum in Thailand and internationally. It is also involved in gas pipeline transportation business; investment funding; the provision of petroleum-related technology; and the provision of petroleum products, such as natural gas, crude oil, condensate, naphtha and liquefied petroleum gas. The company was founded in 1985 and is headquartered in Bangkok, Thailand. PTT Exploration and Production Public Company Limited is a subsidiary of PTT Public Company Limited.",
        "sector": "Energy"
    },
    {
        "symbol":"PTTGC",
        "name":"PTT Global Chemical Public Company Limited ",
        "description": "PTT Global Chemical Public Company Limited produces and distributes ethylene, propylene, polyethylene plastic pellets, and biochemical products. It operates through seven segments: Refinery, Aromatics, Olefins and Derivatives, Green Chemicals, Performance Materials and Chemicals, Service and Others, and Investments in Other Joint Ventures and Associates. The company offers refined products, including liquefied petroleum gas (LPG), light naphtha, reformate, jet fuel, diesel, and fuel oil. It also provides aromatics products, such as benzene, paraxylene, cyclohexane, and orthoxylene; olefins comprising ethylene and propylene, mixed c4, tail gas, cracker bottom, hydrogen, and pyrolysis gasoline; and polymers consisting of HDPE, LDPE, LLDPE, PP, PTA, PET, PS, and rotomolding compounds. In addition, the company offers EO-based performance products, including ethylene glycol and ethanolamine; green chemicals, such as methyl ester, glycerin, fatty acid and alcohol, ethoxylate, oleochemicals, and bioplastic; and phenol, bisphenol A, and acetone. Further, it provides hexamethylene diisocyanate and derivatives, as well as acrylonitrile and methyl methacrylate. Additionally, the company operates production support facilities, such as jetty and buffer tank farm services for liquid chemical, and oil and gas; and manufactures and distributes health and nutrition products. It also offers factory maintenance and engineering services; real estate development services; safety and environmental services; service for the storage and handling of liquid chemicals, oil, and gas; and research and development of bio-based chemicals. In addition, the company produces and distributes electricity, water, steam, and other utilities. It offers its products in Thailand, the People's Republic of China, Vietnam, Singapore, India, Malaysia, Indonesia, Japan, the United States, and internationally. The company is headquartered in Bangkok, Thailand.",
        "sector": "Basic Materials"
    },
    {
        "symbol":"RATCH",
        "name":"Ratch Group Public Company Limited",
        "description": "Ratch Group Public Company Limited, through its subsidiaries, generates and sells electricity in Thailand, Australia, and internationally. It operates through Domestic Electricity Generating, Renewable Energy, and International Power Projects segments. The company generates electricity through natural gas, coal, and fuel oil, as well as solar power, wind power, and biomass renewable projects. As of December 31, 2020, it had a total installed capacity of 8,174 megawatts. Ratch Group Public Company Limited also provides power plant operation and maintenance services, as well as invests in the power energy business. The company was formerly known as Ratchaburi Electricity Generating Holding Public Company Limited and changed its name to Ratch Group Public Company Limited in April 2019. Ratch Group Public Company Limited was incorporated in 2000 and is headquartered in Nonthaburi, Thailand.",
        "sector": "Utilities"
    },
    {
        "symbol":"SAWAD",
        "name":"Srisawad Corporation Public Company Limited",
        "description": "Srisawad Corporation Public Company Limited, together with its subsidiaries, provides finance services in Thailand. It offers hire-purchase and loan, and non-performing assets management services. The company also invests in other companies; and provides management and consulting services for retail credit systems in local and foreign countries, as well as credit sale in foreign countries. In addition, it provides digital personal loan services. The company was formerly known as Srisawad Power 1979 Public Company Limited and changed its name to Srisawad Corporation Public Company Limited in July 2017. Srisawad Corporation Public Company Limited is based in Bangkok, Thailand.",
        "sector": "Financial Services"
    },
    {
        "symbol":"SCB",
        "name":"The Siam Commercial Bank Public Company Limited",
        "description": "The Siam Commercial Bank Public Company Limited provides various financial products and services. It operates in four segments: Corporate, SME, Retail, and Insurance. The company offers deposit products, such as savings, current, fixed deposit, long term deposit, foreign currency, and E passbook deposit accounts; home, car, personal, and mortgage loans; debit, prepaid, and credit cards; investment products comprising mutual funds, debentures, bonds, and other investments; accident, savings, health expense, income protection, heritage and life protection, travel, motor, property, unit linked, and other insurance products; and various payment services. It also provides credit facilities, such as overdrafts, promissory notes, clean bill discounts, long term loans, letter of guarantee, standby letter of credit, and acceptance/Aval; financial advisory and merger acquisition services; fixed income instrument and underwriting services; structured and project finance services; and foreign exchange and interest rate risk management services. In addition, the company offers business collection, business payments, and bank accounts and liquidity management solutions; corporate trust services, including custody, mutual fund supervisor, registrar, escrow agent, security agent, and debenture holder's representative services; international trade remittance, fund transfer, and foreign exchange services; business solutions; and digital banking services. It provides its products and services through its head office and branch network in Thailand; and through its branches in Singapore, Hong Kong, Laos, Vietnam, China, and the Cayman Islands, as well as through its subsidiaries in Thailand, Singapore, Cambodia, and Myanmar. The Siam Commercial Bank Public Company Limited was founded in 1906 and is headquartered in Bangkok, Thailand.",
        "sector": "Financial Services"
    },
    {
        "symbol":"SCC",
        "name":" The Siam Cement Public Company Limited",
        "description": "The Siam Cement Public Company Limited, together with its subsidiaries, engages in cement, building materials, chemicals, packaging, and investment businesses in Thailand, Vietnam, Indonesia, China, and internationally. The company operates through Cement-Building Materials Business, Chemicals Business, Packaging Business, and Other segments. The Cement-Building Materials Business segment manufactures and sells grey cement, ready-mixed concrete, white cement, dry mortar, roof tiles, concrete paving blocks, ceramic tiles, and sanitary wares and fittings. It also distributes cement, building, and decorative products through distributors; and imports fuel products and waste paper. The Chemicals Business segment manufactures and sells olefins, polyolefins, and other chemical products. The Packaging Business segment manufactures and distributes paper and plastic packaging products, pulp, dissolving pulp, and printing and writing paper. The Other segment invests primarily in agricultural machines, automotive parts and components, and steel business, as well as other services. The company was founded in 1913 and is headquartered in Bangkok, Thailand.",
        "sector": "Basic Materials"
    },
    {
        "symbol":"SCGP",
        "name":"SCG Packaging Public Company Limited",
        "description": "SCG Packaging Public Company Limited, through its subsidiaries, produces and sells corrugated containers, retail display packaging, and flexible and rigid packaging for display and protection of products in Southeast Asia. It offers flexible and rigid primary packaging; secondary packaging, such as folding carton; and tertiary packaging, including corrugated containers, parcel box, and paper pallet. The company also offers food safety packaging, packaging papers, and eucalyptus wood. In addition, it offers services in the areas of designing and developing products with expertise in graphic design, product structure, and production using paper and other materials; and Paper X, a service to buy waste paper through an application. Further, the company offers design and manufacturing services for the small lot and on-demand packaging for SMEs; packaging design services; E-Commerce services; and an integration of services for marketing events. The company was founded in 1979 and is headquartered in Bangkok, Thailand. SCG Packaging Public Company Limited is a subsidiary of The Siam Cement Public Company Limited.",
        "sector": "Consumer Cyclical"
    },
    {
        "symbol":"STA",
        "name":"Sri Trang Agro-Industry Public Company Limited",
        "description": "Sri Trang Agro-Industry Public Company Limited, together with its subsidiaries, manufactures and distributes natural rubber products in Thailand, China, the United States, Singapore, Japan, and internationally. The company operates in four segments: Natural Rubber Products, Gloves, and Other Businesses. The Natural Rubber Products segment manufactures, sells, and trade in ribbed smoked sheets, concentrated latex, and block rubbers. The Gloves segment manufactures and sells powdered and powderfree latex examination gloves. The Other Businesses segment engages in the plantation activities, such as rubber, palm, trees, and temperate fruits; and manufacture and sale of escalator handrails, rubber injection-moulded goods, and high-pressure hydraulic hoses. This segment also offers engineering services that include research and development of machinery and production processes, as well as information system services; and logistics and other services. It also offers processed rubber wood and medical gloves; and information technology service. Sri Trang Agro-Industry Public Company Limited was founded in 1987 and is headquartered in Hat Yai, Thailand.",
        "sector": "Consumer Cyclical"
    },
    {
        "symbol":"STGT",
        "name":"Sri Trang Gloves (Thailand) Public Company Limited",
        "description": "Sri Trang Gloves (Thailand) Public Company Limited produces and sells rubber gloves in Singapore, Thailand, the United States, China, Germany, Japan, and internationally. It provides natural rubber powdered, natural rubber powderfree, and nitrile butadiene rubber gloves under the Satory, Finnx, and Sri Trang Gloves brand names for various applications, including healthcare and medical, as well as food processing, handling, manufacturing, and operations. The company was founded in 1989 and is based in Hat Yai, Thailand. Sri Trang Gloves (Thailand) Public Company Limited is a subsidiary of Sri Trang Agro-Industry Public Company Limited.",
        "sector": "Basic Materials"
    },
    {
        "symbol":"TISCO",
        "name":"TISCO Financial Group Public Company Limited",
        "description": "TISCO Financial Group Public Company Limited provides commercial banking products and services for individuals and businesses in Thailand. It operates through Commercial Banking Business, Securities Business, and Asset Management Business segments. The company accepts deposit products, such as current accounts, savings accounts, fixed deposit accounts, and certificates of deposit, as well as cards and bill payment services. It also provides personal loans, such as home loan, new and used car loans, and loans against inheritance pension; and corporate loans, including project and long term loans, short term loans, and guarantee products. In addition, the company offers investment services, including stock and derivative brokerage, mutual funds, private funds, and provident funds, as well as super savings fund /retirement mutual funds; and insurance services, such as life, retirement, health and critical illness, personal accident, car, and home insurance. Further, it provides investment banking services that financial advisory and underwriting for merger and acquisition, privatization advisory and implementation, project financing, debt restructuring, feasibility study, project valuation, general advisory, etc.; and private banking, and wealth and asset management services. Additionally, the company offers mobile banking, custodian, assets for sale, car auction, hire purchase, and SME lending services. As of December 31, 2020, it operated through a network of 347 branches under the Somwang brand. TISCO Financial Group Public Company Limited was founded in 1969 and is based in Bangkok, Thailand.",
        "sector": "Financial Services"
    },
    {
        "symbol":"TOP",
        "name":"Thai Oil Public Company Limited",
        "description": "Thai Oil Public Company Limited, together with its subsidiaries, engages in the oil refining and distribution, petrochemicals, lube base oil, and other businesses in Thailand and internationally. It operates through Oil Refinery, Lube Base Oil Refinery, Petrochemical, Power Generation, Marine Transportation Services, Solvent, Ethanol, and Others segments. The company produces gasoline, diesel/gas oil, jet fuel, kerosene, fuel oil, and liquefied petroleum gas; and petrochemical products, such as paraxylene, benzene, toluene, and mixed xylenes. It also produces and distributes lube base oil, bitumen/asphalt, and other by-products, as well as special products, such as treated distillate aromatics extract and slack wax; and hydrocarbon and chemical solvents, and other chemicals. In addition, the company operates natural gas-fired combined-cycle co-generation power plants that generate and sell electricity, steam, and utilities to industrial users, as well as invests in other power generating companies and related business. Further, it is involved in the marine transportation of petroleum, petrochemical, and liquid chemical products; production of ethanol; provision of marine transportation services for crew and utilities; and biogas power generation and distribution. Additionally, the company provides human resource management services; and manufactures and sells linear alkyl benzene and related products. Thai Oil Public Company Limited was founded in 1961 and is headquartered in Bangkok, Thailand.",
        "sector": "Energy"
    },
    {
        "symbol":"TRUE",
        "name":"True Corporation Public Company Limited",
        "description": "True Corporation Public Company Limited, together with its subsidiaries, engages in the telecommunications and diversified communications industries in Thailand. The company operates through TrueMove H, TrueOnline, and TrueVisions segments. It offers mobile, broadband Internet, Wi-Fi, content and media, television, and digital platforms. The company is also involved in entertainment, mobile equipment lessor, program production, non-government telecommunication, artist management and related, Internet services provider and distributor, and marketing management activities. In addition, it operates news channel; and provides business solutions, online digital media services on website and telecommunication devices, distribution center services, consultancy and management services related to logistics, advertising sale and agency services, wireless telecommunication services, pay television via cable system, and football club and related activities management services. Further, the company operates as a content provider; designs, develops, produces, and sells software products; and offers data analytics and digital solutions, and hospitality technology, as well as business process outsourcing services in technical service, marketing, and customer relations. The company was formerly known as TelecomAsia Corporation Public Company Limited and changed its name to True Corporation Public Company Limited in April 2004. True Corporation Public Company Limited was incorporated in 1990 and is headquartered in Bangkok, Thailand.",
        "sector": "Communication Services"
    },
    {
        "symbol":"TU",
        "name":"Thai Union Group Public Company Limited",
        "description": "Thai Union Group Public Company Limited, together with its subsidiaries, manufactures and sells frozen, chilled, and canned seafood in Thailand and internationally. The company operates through three segments: Ambient Seafood; Frozen and Chilled Seafood and Related Businesses; and Pet food, Value-Added and Other Businesses. It offers ambient seafood products, including tuna, sardines, salmon, mackerel, herring, and salmon for retail and wholesale customers; frozen and chilled seafood, such as shrimp, lobster, and crab sold directly to restaurants, hotels, and caterers; ready-to-cook or ready-to-serve products, as well as bakery treats; marine ingredients for use in consumer goods, such as infant formula, cosmetics, dietary supplements, and clinical nutrition; and pet care products comprising surimi-based fish snacks, canned cod liver, and wet seafood-based cat and dog foods. The company provides its products under the Chicken of the Sea, Genova, John West, Petit Navire, Parmentier, King Oscar, Mareblu, Rügen Fisch, Sealect, Fisho, QFresh, Monori, Bellotta, and Marvo brands. It also manufactures and distributes canned tuna and seafood, pet food, frozen shrimps, animal feeds, frozen foods and aquatic animals, ingredients, canned sardines and mackerel, and smoked salmon. In addition, the company offers printing manufacturing, logistic, training and management, e-commerce, consultancy, technical, and property rental services. Further, it is involved in the packaging, tuna oil refinery, and shrimp breeding and hatchery businesses. The company was formerly known as Thai Union Frozen Products Public Company Limited and changed its name to Thai Union Group Public Company Limited in September 2015. Thai Union Group Public Company Limited was founded in 1977 and is headquartered in Mueang Samut Sakhon, Thailand.",
        "sector": "Consumer Defensive"
    }
]
}
